import * as Yup from 'yup'

export const loginSchema = Yup.object().shape({
    email: Yup.string().required("ایمیل الزامی است.").email("ایمیل وارد شده معتبر نمی باشد."),
    password: Yup.string()
        .min(4, "کلمه عبور نباید کمتر از 4 کاراکتر باشد")
        .max(255, "کلمه عبور نباید بیشتر از 255 کاراکتر باشد")
        .matches(
            /^(?=.*?[A-Z])(?=.*?[a-z])(?=.*?[0-9]).{8,}$/,
            "باید حداقل شامل 8 کاراکتر و حروف کوچک و بزرگ و اعداد باشد")
        .required("کلمه عبور الزامی می باشد"),
})

export const registerSchema = Yup.object().shape({
    email: Yup.string().required("ایمیل الزامی است.").email("ایمیل وارد شده معتبر نمی باشد."),
    password: Yup.string()
        .min(4, "کلمه عبور نباید کمتر از 4 کاراکتر باشد")
        .max(255, "کلمه عبور نباید بیشتر از 255 کاراکتر باشد")
        .matches(
            /^(?=.*?[A-Z])(?=.*?[a-z])(?=.*?[0-9]).{8,}$/,
            "باید حداقل شامل 8 کاراکتر و حروف کوچک و بزرگ و اعداد باشد")
        .required("کلمه عبور قبلی الزامی می باشد"),
    username: Yup.string()
        .required("کلمه کاربری الزامی است.")
        .min(3, "کلمه کاربری نباید کمتر از سه کاراکتر باشد.")
        .max(25, "کلمه کاربری نباید بیشتر از 25 کراکتر باشد.")
})